tap "cjbassi/gotop" # https://github.com/cjbassi/gotop
tap "homebrew/bundle" # https://github.com/Homebrew/homebrew-bundle
tap "homebrew/cask" # https://github.com/Homebrew/homebrew-cask
tap "homebrew/core"
tap "homebrew/services" # https://github.com/Homebrew/homebrew-services
tap "octo-cli/octo"
tap "homebrew/services"

brew "ack"
brew "asciidoc"
brew "autoconf"
brew "autojump"
brew "automake"
brew "chruby"
brew "cjbassi/gotop/gotop"
brew "cmake"
brew "curl"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "freetype"
brew "geoip"
brew "gist"
brew "git-extras"
brew "git-lfs"
brew "git-sh"
brew "git"
brew "gettext"
brew "gnu-tar"
brew "gnupg"
brew "glib"
brew "go"
brew "gotop"
brew "gh"
brew "ghi"
brew "gradle"
brew "graphviz"
brew "grc"
brew "groovy"
brew "hh"
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "ipcalc"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "launchdns"
brew "lftp"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgda"
brew "libmpc"
brew "libunistring"
brew "libxml2"
brew "libxmlsec1"
brew "libgpg-error"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "lighttpd"
brew "macvim"
brew "maven"
brew "md5sha1sum"
brew "memcached"
brew "memtester"
brew "mercurial"
brew "multimarkdown"
brew "mysql"
brew "neon"
brew "ncdu"
brew "nginx"
brew "nmap"
brew "nnn"
brew "node"
brew "nodenv"
brew "octo"
brew "oniguruma"
brew "openjdk"
brew "openssl@1.1"
brew "ossp-uuid"
brew "pcre"
brew "pkg-config"
brew "pidof"
brew "pixman"
brew "postgresql"
brew "pth"
brew "python@3.9"
brew "qpdf"
brew "rarian"
brew "rbenv-default-gems"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "ruby-install"
brew "ruby"
brew "scons"
brew "sqlite"
brew "shared-mime-info"
brew "speedtest-cli"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "subversion"
brew "switchaudio-osx"
brew "texi2html"
brew "the_silver_searcher" # A code-searching tool similar to ack, but faster. http://geoff.greer.fm/ag/ # Example: ag texttofind filestosearch
brew "tig"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yasm"
brew "xz"
brew "youtube-dl"
brew "z"
brew "zlib"
brew "zsh"

cask "xquartz"

# Install App Store automation: https://github.com/mas-cli/mas
mas "Evernote", id: 406056744
# mas "Things 3", id: 904280696
# mas "1Password 6", id: 443987910
mas "Moom", id: 419330170
mas "MindNode 5", id: 1289197285
# mas "Gemini 2", id: 1090488118
# mas "Bear", id: 1091189122
mas "Slack", id: 803453959
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Keynote", id: 409183694
