tap 'caskroom/cask' # https://github.com/Homebrew/homebrew-cask
tap 'github/bootstrap' # https://github.com/github/homebrew-bootstrap
tap 'homebrew/bundle' # https://github.com/Homebrew/homebrew-bundle
tap 'homebrew/services' # https://github.com/Homebrew/homebrew-services
tap 'cjbassi/gotop' # https://github.com/cjbassi/gotop
tap `octo-cli/octo`

cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appcleaner'
cask 'araxis-merge'
cask 'atom'
cask 'box-sync'
cask 'carbon-copy-cloner'
cask 'dropbox'
cask 'duet'
cask 'encryptme'
cask 'gawk'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'java'
cask 'keepingyouawake'
cask 'mailplane'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'noun-project'
cask 'skype'
cask 'sublime-text'
cask 'textmate'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'whatsapp'
cask "xquartz"
cask 'zoomus'

brew "ack"
brew "asciidoc"
brew "autoconf"
brew "autojump"
brew "automake"
brew "chruby"
brew "cjbassi/gotop/gotop"
brew "cmake"
brew "curl"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "freetype"
brew "geoip"
brew "gettext"
brew "gh"
brew "ghi"
brew "gist"
brew "git-extras"
brew "git-lfs"
brew "git-sh"
brew "git"
brew "glib"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gotop"
brew "gradle"
brew "graphviz"
brew "grc"
brew "groovy"
brew "hh"
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "ipcalc"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "launchdns"
brew "lftp"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgda"
brew "libgpg-error"
brew "libmpc"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libxml2"
brew "libxmlsec1"
brew "lighttpd"
brew "macvim"
brew "maven"
brew "md5sha1sum"
brew "memcached"
brew "memtester"
brew "mercurial"
brew "multimarkdown"
brew "mysql"
brew "ncdu"
brew "neon"
brew "nginx"
brew "nmap"
brew "nnn"
brew "node"
brew "nodenv"
brew "octo"
brew "oniguruma"
brew "openjdk"
brew "openssl"
brew "ossp-uuid"
brew "pcre"
brew "pidof"
brew "pixman"
brew "pkg-config"
brew "postgresql"
brew "pth"
brew "python"
brew "qpdf"
brew "rarian"
brew "rbenv-default-gems"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "ruby-install"
brew "ruby"
brew "scons"
brew "shared-mime-info"
brew "speedtest-cli"
brew "sphinx-doc"
brew "sqlite"
brew "ssh-copy-id"
brew "subversion"
brew "switchaudio-osx"
brew "texi2html"
brew "the_silver_searcher" # A code-searching tool similar to ack, but faster. http://geoff.greer.fm/ag/ # Example: ag texttofind filestosearch
brew "tig"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xz"
brew "yasm"
brew "youtube-dl"
brew "z"
brew "zlib"
brew "zsh"

# Install App Store automation: https://github.com/mas-cli/mas
mas "Evernote", id: 406056744
mas "Things 3", id: 904280696
mas "Monosnap", id: 540348655
mas "1Password 7", id: 443987910
mas "Moom", id: 419330170
mas "Monosnap", id: 540348655
mas "MindNode 5", id: 1289197285
mas "Gemini 2", id: 1090488118
mas "Bear", id: 1091189122
mas "Slack", id: 803453959
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
